app/Common.php

SELECT *
FROM `tbl_designasset`
WHERE `designasset_status` = 1
ORDER BY `designasset_group` ASC, `designasset_sort` ASC
---
	function bxsea_design_asset_records(bool $refresh = false): array
	{
		static $records = null;

		if ($refresh || $records === null) {
			$records = [];

			try {
				$db = \Config\Database::connect();
				if (! $db->tableExists('tbl_designasset')) {
					return $records;
				}

				$query = $db->table('tbl_designasset')
					->where('designasset_status', 1)
					->orderBy('designasset_group', 'ASC')
					->orderBy('designasset_sort', 'ASC')
					->get();